
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 1 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.et_acas_subscription_key
* Replace
  * azurerm_api_management_subscription.et_acas_subscription
  * azurerm_api_management_user.et_api_management_user


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_api_management_subscription.et_acas_subscription must be replaced
-/+ resource "azurerm_api_management_subscription" "et_acas_subscription" {
      ~ allow_tracing       = false -> true
      ~ id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/subscriptions/d0d6a8b1-af3a-458e-86c2-29fabc413001" -> (known after apply)
      ~ primary_key         = (sensitive value)
      ~ secondary_key       = (sensitive value)
      ~ subscription_id     = "d0d6a8b1-af3a-458e-86c2-29fabc413001" -> (known after apply)
      ~ user_id             = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/users/5931a75ae4bbd512288c888c" -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # azurerm_api_management_user.et_api_management_user must be replaced
-/+ resource "azurerm_api_management_user" "et_api_management_user" {
      ~ email               = "Peter.Moores@hmcts.net" -> "Harpreet.Jhita@justice.gov.uk"
      ~ first_name          = "Peter" -> "Harpreet"
      ~ id                  = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.ApiManagement/service/cft-api-mgmt-stg/users/5931a75ae4bbd512288c888c" -> (known after apply)
      ~ last_name           = "Moores" -> "Jhita"
      ~ state               = "active" -> (known after apply)
      ~ user_id             = "5931a75ae4bbd512288c888c" -> "5931a75ae4bbd512288c480c" # forces replacement
        # (3 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.et_acas_subscription_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "et_acas_subscription_key" {
        id                      = "https://et-sya-api-aat.vault.azure.net/secrets/etacas-subscription-key/4ea8e56b815d48208d6fe2af593225aa"
        name                    = "etacas-subscription-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1242,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->